Revit 2025 API
RebarBendData.BarNominalDiameter Property
 Defines the nominal diameter of the bar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double BarNominalDiameter { get; set; }
Public Property BarNominalDiameter As Double
	Get
	Set
public:
property double BarNominalDiameter {
	double get ();
	void set (double value);
}
member BarNominalDiameter : float with get, set
Property Value
Double
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace